#+TITLE: DWSMS Planning file

* Planning [6/11]

** DONE Get URL Resources loaded into DW server
** DONE Serve static files using AssetBundle
** DONE Should build simple HTML pages with FreeMarker backed views
** DONE Should use FreeMarker inheritance to have flexible html
** DONE Parse a user submitted date into a LocalDateTime object
   CLOCK: [2014-12-24 Wed 11:24]--[2014-12-24 Wed 11:30] =>  0:06
** DONE Load the date format string from config file, pass to whoever needs it
   CLOCK: [2014-12-24 Wed 11:30]--[2014-12-24 Wed 11:49] =>  0:19
** TODO Load the "from" phone number from config file
   CLOCK: [2014-12-24 Wed 11:49]--[2014-12-24 Wed 12:11] =>  0:22
** TODO Setup Backbone/Marionette app
*** Is this needed?
*** Maybe do SPA as a stretch goal...
** TODO Should load Twilio dev tokens from config.json
** TODO should put all logs to /logs folder
** TODO User can submit a future message [0/3]
*** TODO message is a phone number, text, and date
*** TODO message is stored in a priortity queue based on date
*** TODO have a Resource to view submitted messages to verify they were saved

* Notes

** Don't consider timezones
Uhh, timezones. Always giving problems.
The server will run in whatever timezone, and everything will be considerd in that timezone.

*** TODO Does Twilio provide timezone of message that is received?
something to read in the docs or talk to people
